AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/adc10_a.c
    //Set ADC10_A Control 2
    HWREG16(baseAddress + OFS_ADC10CTL2) =
        (clockSourceDivider & ADC10PDIV_3) //Set Clock Pre-Divider
        + ADC10RES; //Default resolution to 10-bits

    return ( retVal) ;
}

//*****************************************************************************
//
//! Enables the ADC10_A block.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//!
//! This will enable operation of the ADC10_A block.
//! Modified bits are \b ADC10ON of \b ADC10CTL0 register.
//!
//! \return None.
//
//*****************************************************************************
void ADC10_A_enable (uint32_t baseAddress)
{
    //Reset the ADC10ON bit to enable the ADC10_A Module
    HWREG16(baseAddress + OFS_ADC10CTL0) |= ADC10ON;
}

//*****************************************************************************
//
//! Disables the ADC10_A block.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//!
//! This will disable operation of the ADC10_A block.
//! Modified bits are \b ADC10ON of \b ADC10CTL0 register.
//!
//! \return None.
//
//*****************************************************************************
void ADC10_A_disable (uint32_t baseAddress)
{
    //Set the ADC10ON bit to disable the ADC10_A Module
    HWREG16(baseAddress + OFS_ADC10CTL0) &= ~ADC10ON;
}

//*****************************************************************************
//
//! Sets up and enables the Sampling Timer Pulse Mode.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param clockCycleHoldCount sets the amount of clock cycles to
//!       sample-and-hold for the memory buffer.
//!        Valid values are
//!        \b ADC10_A_CYCLEHOLD_4_CYCLES [Default]
//!        \b ADC10_A_CYCLEHOLD_8_CYCLES
//!        \b ADC10_A_CYCLEHOLD_16_CYCLES
//!        \b ADC10_A_CYCLEHOLD_32_CYCLES
//!        \b ADC10_A_CYCLEHOLD_64_CYCLES
//!        \b ADC10_A_CYCLEHOLD_96_CYCLES
//!        \b ADC10_A_CYCLEHOLD_128_CYCLES
//!        \b ADC10_A_CYCLEHOLD_192_CYCLES
//!        \b ADC10_A_CYCLEHOLD_256_CYCLES
//!        \b ADC10_A_CYCLEHOLD_384_CYCLES
//!        \b ADC1 0_CYCLEHOLD_512_CYCLES
//!        \b ADC10_A_CYCLEHOLD_768_CYCLES
//!        \b ADC10_A_CYCLEHOLD_1024_CYCLES
//!        Modified bits are \b ADC10SHTx of \b ADC10CTL0 register.
//! \param multipleSamplesEnabled allows multiple conversions to start
//!       without a trigger signal from the sample/hold signal
//!        Valid values are
//!        \b ADC10_A_MULTIPLESAMPLESDISABLE - a timer trigger will be needed to
//!                  start every ADC conversion.
//!        \b ADC10_A_MULTIPLESAMPLESENABLE  - during a sequenced and/or repeated
//!                  conversion mode, after the first conversion, no sample/hold
//!                  signal is necessary to start subsequent samples.
//!        Modified bits are \b ADC10MSC of \b ADC10CTL0 register.
//!
//! This function sets up the sampling timer pulse mode which allows the
//! sample/hold signal to trigger a sampling timer to sample-and-hold an input
//! signal for a specified number of clock cycles without having to hold the
//! sample/hold signal for the entire period of sampling. Note that if a
//! conversion has been started with the startConversion() function, then a call
//! to disableConversions() is required before this function may be called.
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_setupSamplingTimer (uint32_t baseAddress,
    uint16_t clockCycleHoldCount,
    unsigned short multipleSamplesEnabled)
{
    //Make sure the ENC bit is cleared before setting up sampling pulse mode
    assert( !(HWREG16(baseAddress + OFS_ADC10CTL0) & ADC10ENC) );

    assert(clockCycleHoldCount <= ADC10_A_CYCLEHOLD_1024_CYCLES);

    HWREG16(baseAddress + OFS_ADC10CTL1) |= ADC10SHP;

    //Reset and Set CB Control 0 Bits
    HWREG16(baseAddress + OFS_ADC10CTL0) &= ~(ADC10SHT_15 + ADC10MSC);
    HWREG16(baseAddress + OFS_ADC10CTL0) |= clockCycleHoldCount
                                          + multipleSamplesEnabled;
}

//*****************************************************************************
//
//! Disables Sampling Timer Pulse Mode.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//!
//! Disables the Sampling Timer Pulse Mode. Note that if a conversion has been
//! started with the startConversion() function, then a call to
//! disableConversions() is required before this function may be called.
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_disableSamplingTimer (uint32_t baseAddress)
{
    //Make sure the ENC bit is cleared before disabling sampling pulse mode
    assert( ~(HWREG16(baseAddress + OFS_ADC10CTL0) & ADC10ENC) );

    HWREG16(baseAddress + OFS_ADC10CTL1) &= ~(ADC10SHP);
}

//*****************************************************************************
//
//! Configures the controls of the selected memory buffer.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param inputSourceSelect is the input that will store the converted data
//!       into the specified memory buffer.
//!        Valid values are
//!        \b ADC10_A_INPUT_A0 [Default]
//!        \b ADC10_A_INPUT_A1
//!        \b ADC10_A_INPUT_A2
//!        \b ADC10_A_INPUT_A3
//!        \b ADC10_A_INPUT_A4
//!        \b ADC10_A_INPUT_A5
//!        \b ADC10_A_INPUT_A6
//!        \b ADC10_A_INPUT_A7
//!        \b ADC10_A_INPUT_A8
//!        \b ADC10_A_INPUT_A9
//!        \b ADC10_A_INPUT_TEMPSENSOR
//!        \b ADC10_A_INPUT_BATTERYMONITOR
//!        \b ADC10_A_INPUT_A12
//!        \b ADC10_A_INPUT_A13
//!        \b ADC10_A_INPUT_A14
//!        \b ADC10_A_INPUT_A15
//!        Modified bits are \b ADC10INCHx of \b ADC10MCTL0 register.
//! \param positiveRefVoltageSourceSelect is the reference voltage source to set
//!       as the upper limit for the conversion that is to be stored in the
//!       specified memory buffer.
//!        Valid values are
//!        \b ADC10_A_VREFPOS_AVCC [Default]
//!        \b ADC10_A_VREFPOS_EXT
//!        \b ADC10_A_VREFPOS_INT
//!        Modified bits are \b ADC10SREF of \b ADC10MCTL0 register.
//! \param negativeRefVoltageSourceSelect is the reference voltage source to set
//!       as the lower limit for the conversion that is to be stored in the
//!       specified memory buffer.
//!        Valid values are
//!        \b ADC10_A_VREFPOS_AVSS [Default]
//!        \b ADC10_A_VREFPOS_EXT
//!        Modified bits are \b ADC10SREF of \b ADC10CTL0 register.
//!
//! Maps an input signal conversion into the memory buffer, as
//! well as the positive and negative reference voltages for each conversion
//! being stored into the memory buffer. If the internal reference is used for
//! the positive reference voltage, the internal REF module has to control
//! the voltage level. Note that if a conversion has been started with the
//! startConversion() function, then a call to disableConversions() is required
//! before this function may be called.
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_memoryConfigure (uint32_t baseAddress,
    uint8_t inputSourceSelect,
    uint8_t positiveRefVoltageSourceSelect,
    uint8_t negativeRefVoltageSourceSelect)
{
    //Make sure the ENC bit is cleared before configuring a Memory Buffer Control
    assert( !(HWREG16(baseAddress + OFS_ADC10CTL0) & ADC10ENC) );

    assert(inputSourceSelect <= ADC10_A_INPUT_A15);
    assert(positiveRefVoltageSourceSelect <= ADC10_A_VREFPOS_INT);
    assert(negativeRefVoltageSourceSelect <= ADC10_A_VREFNEG_EXT);

