AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/adc10_a.c
    //Reset and Set the Memory Buffer Control Bits
    HWREG8(baseAddress + OFS_ADC10MCTL0) = inputSourceSelect
                                           + positiveRefVoltageSourceSelect +
                                           negativeRefVoltageSourceSelect;
}

//*****************************************************************************
//
//! Enables selected ADC10_A interrupt sources.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param interruptMask is the bit mask of the memory buffer interrupt
//!       sources to be enabled.
//!        Mask Value is the logical OR of any of the following
//!        \b ADC10OVIE - Interrupts when a new conversion is about to overwrite
//!                 the previous one
//!        \b ADC10TOVIE - Interrupts when a new conversion is starting befor
//!                 the previous one has finished
//!        \b ADC10HIIE - Interrups when the input signal has gone above the
//!                 high threshold of the window comparator
//!        \b ADC10LOIE - Interrupts when the input signal has gone below the
//!                 low threshold of the low window comparator
//!        \b ADC10INIE - Interrupts when the input signal is in between the
//!                 high and low thresholds of the window comparator
//!        \b ADC10IE0 - Interrupt for new conversion data in the memory buffer
//!
//! Enables the indicated ADC10_A interrupt sources.  Only the sources that
//! are enabled can be reflected to the processor interrupt; disabled sources
//! have no effect on the processor. <b>Does not clear interrupt flags.</b>
//! Modified registers are \b ADC10IE.
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_enableInterrupt (uint32_t baseAddress,
    uint8_t interruptMask)
{
    HWREG16(baseAddress + OFS_ADC10IE) |= interruptMask;
}

//*****************************************************************************
//
//! Disables selected ADC10_A interrupt sources.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param interruptMask is the bit mask of the memory buffer interrupt
//!       sources to be disabled.
//!        Mask Value is the logical OR of any of the following
//!        \b ADC10OVIE - Interrupts when a new conversion is about to overwrite
//!                 the previous one
//!        \b ADC10TOVIE - Interrupts when a new conversion is starting befor
//!                 the previous one has finished
//!        \b ADC10HIIE - Interrups when the input signal has gone above the
//!                 high threshold of the window comparator
//!        \b ADC10LOIE - Interrupts when the input signal has gone below the
//!                 low threshold of the low window comparator
//!        \b ADC10INIE - Interrupts when the input signal is in between the
//!                 high and low thresholds of the window comparator
//!        \b ADC10IE0 - Interrupt for new conversion data in the memory buffer
//!
//! Disables the indicated ADC10_A interrupt sources.  Only the sources that
//! are enabled can be reflected to the processor interrupt; disabled sources
//! have no effect on the processor.
//! Modified registers are ADC10IE.
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_disableInterrupt (uint32_t baseAddress,
    uint8_t interruptMask)
{
    HWREG16(baseAddress + OFS_ADC10IE) &= ~(interruptMask);
}

//*****************************************************************************
//
//! Clears ADC10_A selected interrupt flags.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param interruptFlagMask is a bit mask of the interrupt flags to be cleared.
//!        Mask Value is the logical OR of any of the following
//!        \b ADC10OVIFG - Interrupt flag for when a new conversion is about to
//!                  overwrite the previous one
//!        \b ADC10TOVIFG - Interrupt flag for when a new conversion is starting
//!                 before the previous one has finished
//!        \b ADC10HIIFG - Interrup flag for when the input signal has gone
//!                 above the high threshold of the window comparator
//!        \b ADC10LOIFG - Interrupt flag for when the input signal has gone
//!                 below the low threshold of the window comparator
//!        \b ADC10INIFG - Interrupt flag for when the input signal is in
//!                 between the high and low thresholds of the window comparator
//!        \b ADC10IFG0 - Interrupt flag for new conversion data in the memory
//!                 buffer
//!
//! The selected ADC10_A interrupt flags are cleared, so that it no longer asserts.
//! The memory buffer interrupt flags are only cleared when the memory buffer is
//! accessed.
//! Modified registers are  \b ADC10IFG
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_clearInterrupt (uint32_t baseAddress,
    uint8_t interruptFlagMask)
{
    HWREG16(baseAddress + OFS_ADC10IFG) &= ~(interruptFlagMask);
}

//*****************************************************************************
//
//! Returns the status of the selected memory interrupt flags.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param interruptFlagMask is a bit mask of the interrupt flags status
//!       to be returned.
//!        Mask Value is the logical OR of any of the following
//!        \b ADC10OVIFG - Interrupt flag for when a new conversion is about to
//!                  overwrite the previous one
//!        \b ADC10TOVIFG - Interrupt flag for when a new conversion is starting
//!                 before the previous one has finished
//!        \b ADC10HIIFG - Interrup flag for when the input signal has gone
//!                 above the high threshold of the window comparator
//!        \b ADC10LOIFG - Interrupt flag for when the input signal has gone
//!                 below the low threshold of the window comparator
//!        \b ADC10INIFG - Interrupt flag for when the input signal is in
//!                 between the high and low thresholds of the window comparator
//!        \b ADC10IFG0 - Interrupt flag for new conversion data in the memory
//!                 buffer
//!
//! Returns the status of the selected interrupt flags.
//!
//! \return The current interrupt flag status for the corresponding mask.
//
//*****************************************************************************
uint8_t ADC10_A_getInterruptStatus (uint32_t baseAddress,
    uint8_t interruptFlagMask)
{
    return ( HWREG16(baseAddress + OFS_ADC10IFG) & interruptFlagMask );
}

//*****************************************************************************
//
//! Enables/Starts an Analog-to-Digital Conversion.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param conversionSequenceModeSelect determines the ADC operating mode.
//!        Valid values are
//!        \b ADC10_A_SINGLECHANNEL - one-time conversion of a single channel into
//!           a single memory buffer [Default]
//!        \b ADC10_A_SEQOFCHANNELS - one time conversion of multiple channels
//!           into the specified starting memory buffer and each subsequent
//!           memory buffer up until the conversion is stored in a memory buffer
//!           dedicated as the end-of-sequence by the memory's control register
//!        \b ADC10_A_REPEATED_SINGLECHANNEL - repeated conversions of one channel
//!           into a single memory buffer
//!        \b ADC10_A_REPEATED_SEQOFCHANNELS - repeated conversions of multiple
//!           channels into the specified starting memory buffer and each
//!           subsequent memory buffer up until the conversion is stored in a
//!           memory buffer dedicated as the end-of-sequence by the memory's
//!           control register
//!        Modified bits are \b ADC10CONSEQx of \b ADC10CTL1 register.
//!
//! This function  enables/starts the conversion process of the ADC.
//! If the sample/hold signal source chosen during initialization was
//! ADC10OSC, then the conversion is started immediately, otherwise the chosen
//! sample/hold signal source starts the conversion by a rising edge of the
//! signal. Keep in mind when selecting conversion modes, that for sequenced
//! and/or repeated modes, to keep the sample/hold-and-convert process
//! continuing without a trigger from the sample/hold signal source, the
//! multiple samples must be enabled using the ADC10_A_setupSamplingTimer()
//! function. Also note that when a sequence conversion mode is selected, the
//! first input channel is the one mapped to the memory buffer, the next input
//! channel selected for conversion is one less than the input channel just
//! converted (i.e. A1 comes after A2), until A0 is reached, and if in repeating
//! mode, then the next input channel will again be the one mapped to the memory
//! buffer. Note that after this function is called, the ADC10_A_stopConversions()
//! has to be called to re-initialize the ADC, reconfigure a memory buffer
//! control, enable/disable the sampling timer, or to change the internal
//! reference voltage.
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_startConversion (uint32_t baseAddress,
    uint8_t conversionSequenceModeSelect)
{
    assert(conversionSequenceModeSelect <= ADC10_A_REPEATED_SEQOFCHANNELS);

    //Reset the ENC bit to set the conversion mode sequence
    HWREG16(baseAddress + OFS_ADC10CTL0) &= ~(ADC10ENC);

    HWREG16(baseAddress + OFS_ADC10CTL1) |= conversionSequenceModeSelect;
    HWREG16(baseAddress + OFS_ADC10CTL0) |= ADC10ENC + ADC10SC;
}

//*****************************************************************************
//
//! Disables the ADC from converting any more signals.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param preempt specifies if the current conversion should be preemptly
//!       stopped before the end of the conversion
//!        Valid values are
//!        \b ADC10_A_COMPLETECONVERSION - Allows the ADC10_A to end the current
//!                  conversion before disabling conversions.
//!        \b ADC10_A_PREEMPTCONVERSION - Stops the ADC10_A immediatly, with
//!                  unpredicatble results of the current conversion. Cannot be
//!                  used with repeated conversion.
//!
//! Disables the ADC from converting any more signals.
//! If there is a conversion in progress, this function can stop it immediatly
//! if the preempt parameter is set as ADC10_A_PREEMPTCONVERSION, by changing the
//! conversion mode to single-channel, single-conversion and disabling
//! conversions. If the conversion mode is set as single-channel,
//! single-conversion and this function is called without preemption, then the
//! ADC core conversion status is polled until the conversion is complete before
//! disabling conversions to prevent unpredictable data. If the
//! ADC10_A_startConversion() has been called, then this function has to be called
//! to re-initialize the ADC, reconfigure a memory buffer control,
//! enable/disable the sampling pulse mode, or change the internal reference
//! voltage.
//! Modified registers are  \b ADC10CTL1 and \b ADC10CTL0
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_disableConversions (uint32_t baseAddress, unsigned short preempt)
{
    if (ADC10_A_PREEMPTCONVERSION == preempt){
        HWREG16(baseAddress + OFS_ADC10CTL1) &= ~(ADC10CONSEQ_3);
        //Reset conversion sequence mode to single-channel, single-conversion
    } else if ( ~(HWREG16(baseAddress + OFS_ADC10CTL1) & ADC10CONSEQ_3) ){
        //To prevent preemoption of a single-channel, single-conversion we must
        //wait for the ADC core to finish the conversion.
        while (HWREG16(baseAddress + OFS_ADC10CTL1) & ADC10BUSY) ;
    }

    HWREG16(baseAddress + OFS_ADC10CTL0) &= ~(ADC10ENC);
}

//*****************************************************************************
//
//! Returns the raw contents of the specified memory buffer.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//!
//! Returns the raw contents of the specified memory buffer. The format of the
//! content depends on the read-back format of the data: if the data is in
//! signed 2's complement format then the contents in the memory buffer will be
//! left-justified with the least-siginificant bits as 0's, whereas if the data
//! is in unsigned format then the contents in the memory buffer will be
//! right-justified with the most-significant bits as 0's.
//!
//! \return A Signed Integer of the contents of the specified memory buffer.
//
//*****************************************************************************
int ADC10_A_getResults (uint32_t baseAddress)
{
    return ( HWREG16(baseAddress + OFS_ADC10MEM0) );
}

//*****************************************************************************
//
//! Use to change the resolution of the converted data.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param resolutionSelect determines the resolution of the converted data.
//!        Valid values are
//!        \b ADC10_A_RESOLUTION_8BIT
//!        \b ADC10_A_RESOLUTION_10BIT [Default]
//!        Modified bits are \b ADC10RES of \b ADC10CTL2 register.
//!
//! This function can be used to change the resolution of the converted data
//! from the default of 12-bits.
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_setResolution (uint32_t baseAddress,
    uint8_t resolutionSelect)
{
    assert(resolutionSelect <= ADC10_A_RESOLUTION_10BIT);

    HWREG16(baseAddress + OFS_ADC10CTL2) &= ~(ADC10RES);
    HWREG16(baseAddress + OFS_ADC10CTL2) |= resolutionSelect;
}

//*****************************************************************************
//
//! Use to invert or un-invert the sample/hold signal
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param invertedSignal set if the sample/hold signal should be inverted
//!        Valid values are
//!        \b ADC10_A_NONINVERTEDSIGNAL - a sample-and-hold of an input signal for
//!                  conversion will be started on a rising edge of the
//!                  sample/hold signal. [Default]
//!        \b ADC10_A_INVERTEDSIGNAL  - a sample-and-hold of an input signal for
//!                  conversion will be started on a falling edge of the
//!                  sample/hold signal.
//!        Modified bits are \b ADC10ISSH of \b ADC10CTL1 register.
//!
//! This function can be used to invert or un-invert the sample/hold signal.
//! Note that if a conversion has been started with the startConversion()
//! function, then a call to disableConversions() is required before this
//! function may be called.
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_setSampleHoldSignalInversion (uint32_t baseAddress,
    uint16_t invertedSignal)
{
    //Make sure the ENC bit is cleared before using this function
    assert( !(HWREG16(baseAddress + OFS_ADC10CTL0) & ADC10ENC) );

    HWREG16(baseAddress + OFS_ADC10CTL1) &= ~(ADC10ISSH);
    HWREG16(baseAddress + OFS_ADC10CTL1) |= invertedSignal;
}

//*****************************************************************************
//
//! Use to set the read-back format of the converted data
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param readBackFormat is the specified format to store the conversions in
//!       the memory buffer.
//!        Valid values are
//!        \b ADC10_A_UNSIGNED_BINARY [Default]
//!        \b ADC10_A_SIGNED_2SCOMPLEMENT
//!        Modified bits are \b ADC10DF of \b ADC10CTL2 register.
//!
//! Sets the format of the converted data: how it will be stored into the
//! memory buffer, and how it should be read back. The format can be set as
//! right-justified (default), which indicates that the number will be unsigned,
//! or left-justified, which indicates that the number will be signed in
//! 2's complement format. This change affects all memory buffers for subsequent
//! conversions.
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_setDataReadBackFormat (uint32_t baseAddress,
    unsigned short readBackFormat)
{
    assert(readBackFormat <= ADC10_A_SIGNED_2SCOMPLEMENT);

    HWREG16(baseAddress + OFS_ADC10CTL2) &= ~(ADC10DF);
    HWREG16(baseAddress + OFS_ADC10CTL2) |= readBackFormat;
}

//*****************************************************************************
//
//! Enables the reference buffer's burst ability.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//!
//! Enables the reference buffer's burst ability, allowing the reference buffer
//! to turn off while the ADC is not converting, and automatically turning on
//! when the ADC needs the generated reference voltage for a conversion.
//!
//! Modified bits are \b ADC10REFBURST of \b ADC10CTL2 register.
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_enableReferenceBurst (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_ADC10CTL2) |= ADC10REFBURST;
}

//*****************************************************************************
//
//! Disables the reference buffer's burst ability.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//!
//! Disables the reference buffer's burst ability, forcing the reference buffer
//! to remain on continuously.
//!
//! Modified bits are \b ADC10REFBURST of \b ADC10CTL2 register.
//!
//! \return NONE
//
//*****************************************************************************
void ADC10_A_disableReferenceBurst (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_ADC10CTL2) &= ~(ADC10REFBURST);
}

//*****************************************************************************
//
//! Use to set the reference buffer's sampling rate.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param samplingRateSelect is the specified maximum sampling rate.
//!        Valid values are
//!        \b ADC10_A_MAXSAMPLINGRATE_200KSPS [Default]
//!        \b ADC10_A_MAXSAMPLINGRATE_50KSPS
//!        Modified bits are \b ADC10SR of \b ADC10CTL2 register.
//!
//! Sets the reference buffer's sampling rate to the selected sampling rate. The
//! default sampling rate is maximum of 200-ksps, and can be reduced to a
//! maximum of 50-ksps to conserve power.
//!
//! Modified regsiters are \b ADC10CTL2.
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_setReferenceBufferSamplingRate (uint32_t baseAddress,
    unsigned short samplingRateSelect)
{
    assert(samplingRateSelect <= ADC10_A_MAXSAMPLINGRATE_50KSPS);

