AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/adc10_a.c
    HWREG16(baseAddress + OFS_ADC10CTL2) &= ~(ADC10SR);
    HWREG16(baseAddress + OFS_ADC10CTL2) |= samplingRateSelect;
}

//*****************************************************************************
//
//! Sets the high and low threshold for the window comparator feature.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param highThreshold is the upper bound  that could trip an interrupt for
//!       the window comparator.
//! \param lowThreshold is the lower bound that could trip on interrupt for the
//!       window comparator.
//!
//! Sets the high and low threshold for the window comparator feature. Use the
//! ADC10HIIE, ADC10INIE, ADC10LOIE interrupts to utilize this feature.
//!
//! Modified regsiters are \b ADC10HI and \b ADC10LO.
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_setWindowComp (uint32_t baseAddress,
    uint16_t highThreshold,
    uint16_t lowThreshold)
{
    HWREG16(baseAddress + OFS_ADC10HI) = highThreshold;
    HWREG16(baseAddress + OFS_ADC10LO) = lowThreshold;
}

//*****************************************************************************
//
//! Returns the address of the memory buffer for the DMA module.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//!
//! Returns the address of the memory buffer. This can be used in conjunction
//! with the DMA to store the converted data directly to memory.
//!
//! \return None
//
//*****************************************************************************
uint32_t ADC10_A_getMemoryAddressForDMA (uint32_t baseAddress)
{
    return ( baseAddress + OFS_ADC10MEM0 );
}

//*****************************************************************************
//
//! Returns the busy status of the ADC10_A core.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//!
//! Returns the status of the ADC core if there is a conversion currently taking
//! place.
//!
//! \return ADC10_A_BUSY or ADC10_A_NOTBUSY dependent if there is a conversion
//!        currently taking place.
//
//*****************************************************************************
unsigned short ADC10_A_isBusy (uint32_t baseAddress)
{
    if (HWREG16(baseAddress + OFS_ADC10CTL1) & ADC10BUSY){
        return ( ADC10_A_BUSY) ;
    } else   {
        return ( ADC10_A_NOTBUSY) ;
    }
}

//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************

